//JCL      JOB (ACCT-INFO),'DB2 CREATE',                                JOB01688
// CLASS=A,
// MSGCLASS=7,
// REGION=0M,
// NOTIFY=&SYSUID
//*
//*
//JOBLIB   DD DISP=SHR,DSN=DSN.VD10.SDSNEXIT
//         DD DISP=SHR,DSN=DSN.VD10.SDSNLOAD
//         DD DISP=SHR,DSN=DSN.VD10.RUNLIB.LOAD
//*
//**************************************************
//* DB2 BATCH
//* BATCH JOB TO EXECUTE SQL
//**************************************************
//HAUSKEEP    EXEC PGM=IKJEFT01,DYNAMNBR=100
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSTSIN  DD *
DSN SYSTEM(HL2D)
RUN  PROGRAM(DSNTEP3) PLAN(DSNTEP3)
END
//SYSIN  DD *

--  DROP   DATABASE DBGLDEYE;
--  RETCODE = SQLCHECK(-204,0);
  COMMIT;
//*
//******************************************************************
//*
//CREATE      EXEC PGM=IKJEFT01,DYNAMNBR=100
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSTSIN  DD *
DSN SYSTEM(HL2D)
RUN  PROGRAM(DSNTEP3) PLAN(DSNTEP3)
END
//SYSIN  DD DISP=SHR,
//          DSN=USER24.GLDNEYE.RINGS(DBINSERT)
//*